In [29]:
import pandas as pd
obj = pd.Series([2,3.4,56,7.8])
obj

0     2.0
1     3.4
2    56.0
3     7.8
dtype: float64

In [30]:
obj.values

array([ 2. ,  3.4, 56. ,  7.8])

In [31]:
obj2 = pd.Series([3,3,4.5,6.7], index = ['a','b','c','d'])

In [32]:
obj2

a    3.0
b    3.0
c    4.5
d    6.7
dtype: float64

In [33]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [34]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [35]:
obj2['a']

3.0

In [36]:
'b' in obj2

True

In [37]:
sdata = {'king': 234, 'queen' : 789, 'jan' : 909, 'fish' : 467}
sdata

{'king': 234, 'queen': 789, 'jan': 909, 'fish': 467}

In [38]:
h = pd.Series(sdata)

In [39]:
h

king     234
queen    789
jan      909
fish     467
dtype: int64

In [67]:
name = ['burhan', 'baqar', 'queen', 'baber','right']

In [68]:
g = pd.Series(sdata, index = name)

In [69]:
g

burhan      NaN
baqar       NaN
queen     789.0
baber       NaN
right       NaN
dtype: float64

In [70]:
pd.isnull(g)

burhan     True
baqar      True
queen     False
baber      True
right      True
dtype: bool

In [71]:
obj+obj2

0   NaN
1   NaN
2   NaN
3   NaN
a   NaN
b   NaN
c   NaN
d   NaN
dtype: float64

In [78]:
obj4 = pd.Series([263,72631,8239,129,12687], index=name)
obj4

burhan      263
baqar     72631
queen      8239
baber       129
right     12687
dtype: int64

In [79]:
name2 = ['burhan', 'baqar', 'queen', 'baber', 'yolo']
obj3 = pd.Series([78278,682138,8219,71298,782139], index=name2)

In [80]:
obj3+obj4

baber      71427.0
baqar     754769.0
burhan     78541.0
queen      16458.0
right          NaN
yolo           NaN
dtype: float64

In [82]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],'year': [2000, 2001, 2002, 2001, 2002, 2003],'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]} 
df=pd.DataFrame(data)

In [83]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [87]:
index = ['a','b','c','d','e','f']
df=pd.DataFrame(data, index = index)
df

    state  year  pop
a    Ohio  2000  1.5
b    Ohio  2001  1.7
c    Ohio  2002  3.6
d  Nevada  2001  2.4
e  Nevada  2002  2.9
f  Nevada  2003  3.2

In [89]:
df.head()

    state  year  pop
a    Ohio  2000  1.5
b    Ohio  2001  1.7
c    Ohio  2002  3.6
d  Nevada  2001  2.4
e  Nevada  2002  2.9

In [90]:
df2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four','five', 'six'])

In [91]:
df2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN